greetings = """Компания ElixirPeptide приветствует тебя, *! 👋🏻

<b>Здесь вы можете</b>
📝 <b>Поделиться результатом</b> — заполнить короткую форму и опубликовать свой кейс похудения (анонимно или с ником).
💬 <b>Написать отзыв</b> — поблагодарить сотрудника или компанию, поделиться идеями и высказать свое мнение о товаре, ресурсе или компании 
✉️ <b>Написать Администрации</b> — задать вопрос, предложить идею или сообщить о проблеме напрямую администрации сайта.

<b>Наши ресурсы</b>
📣 <a href="https://t.me/peptide_rus">Чат-форум о пептидах</a> (Обсуждения, вопросы по заказам, отзывы и приятные беседы)
🤖 <a href="https://t.me/elixirpeptidebot?start=reviews">Уникальный Чат-бот</a> (ИИ ассистенты, калькуляторы, магазин)
🌐 <a href="https://elixirpeptide.ru">Интернет сайт</a> (Статьи, ресурсы, магазин)

Выберите действие кнопкой ниже ⬇️"""

share_result_terms = """<b>Перед публикацией согласитесь с условиями:</b>

Все вводные (текст, фото), <b>становятся публичными в ветке результатов и могут быть использованы</b> любыми пользователями интернета для любых целей — в том числе вне этого чата, <b>без ограничений и контроля</b>. Если вы не согласны — <u>просто откажитесь от публикации</u>.

Вы спокойно можете удалить свой результат <b>в любой момент</b>"""

share_result_anonymity = """😊 <b>Отлично! Теперь выберите режим публикации</b>

Анонимный — в графе автора результата будет указано <u>Анонимно</u>
Авторский — в графе автора будет указано <u>*</u>"""

view_drafts = """Теперь <b>выберите черновик из списка ниже</b> для продолжения работы над ним или <b>создадите новый</b>
<i>Черновики сбрасываются раз в неделю, максимум 10 черновиков на человека</i>"""

old_draft = """Сожалеем, у черновика <b>истек срок хранения</b>"""


send_num_weight = "Ошибка. Пожалуйста, отправьте <b>вес числом/цифрой (в килограммах)</b>"
send_whole_num = "Ошибка. Пожалуйста, отправьте <b> ЦЕЛОЕ число/цифру</b>"
wrong_gender = "Ошибка. Пожалуйста, <b>воспользуйтесь кнопками ниже</b> для выбора пола"

mandatory_unfilled = f"⬇️ Ниже указаны поля, <b>еще не заполненные, но обязательные к заполнению</b>. Нажмите на них для перехода к заполнению\n<i>Для редактирования дополнительных полей нажмите на первую кнопку ✏️</i>"
mandatory_filled = (f"🎉 <b>Все обязательные к заполнению поля успешно заполнены!!!</b>\n"
                    f"Вы можете <i>отправить свой результат на публикацию</i> или <i>продолжить редактирование</i> кнопками ниже ⬇️")

blocked = ("Уважаемый *, вы были заблокированы <b>за недобросовестное использование нашего ресурса</b>\n"
           "<i>Если считаете, что была допущена ошибка — напишите в поддержку</i>")

message_admins_start = ("<b>😊 Мы ценим обратную связь от наших клиентов</b>"
                        "и благодарим Вас за желание внести свой вклад в развитие нашего дела.\n\nЕсли вы хотите, чтобы с Вами связались обратно через Телеграм — <i>поделитесь номером телефона кнопкой ниже ⬇️</i>\n"
                        "А так же разрешите нам находить Вас по номеру телефона в телеграм, если до этого убирали эту возможность в настройках конфиденциальности ⚙️\n\n"
                        "Иначе — отправьте ваше сообщение не трогая кнопку")